tap "azure/azure-workload-identity"
tap "azure/kubelogin"
tap "hashicorp/tap"
tap "localstack/tap"
tap "snyk/tap"

brew "argocd"
brew "azcopy"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bulk_extractor"
brew "checkov"
brew "cloc"
brew "cocoapods"
brew "direnv"
brew "exiftool"
brew "eza"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "gitleaks"
brew "go"
brew "grep"
brew "grok"
brew "grpcurl"
brew "gum"
brew "helm"
brew "infracost"
brew "istioctl"
brew "jq"
brew "k9s"
brew "krew"
brew "kubectx"
brew "kustomize"
brew "pipx"
brew "protobuf"
brew "skopeo"
brew "starship"
brew "stow"
brew "terraform-docs"
brew "tflint"
brew "thefuck"
brew "tlrc"
brew "tree"
brew "trivy"
brew "yarn" 
brew "yq"
brew "zoxide"
brew "azure/azure-workload-identity/azwi"
brew "azure/kubelogin/kubelogin"
brew "hashicorp/tap/hcp"
brew "hashicorp/tap/terraform"
brew "localstack/tap/localstack-cli", link: false
brew "snyk/tap/snyk"

cask "android-commandlinetools"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "flutter"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "goland"
cask "google-chrome"
cask "intellij-idea"
cask "jetbrains-toolbox"
cask "lens"
cask "logitech-options"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "postman"
cask "prefs-editor"
cask "redis-insight"
cask "setapp"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "warp"
cask "redisinsight"

vscode "azapi-vscode.azapi"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
